app/views/movies/show.html.erb

SELECT COUNT(*) FROM "reviews" WHERE "reviews"."movie_id" = ?  [["movie_id", 1]]
---
    <h2>Released: <%= @movie.released_on %></h2>
    <h3><%= link_to pluralize(@movie.reviews.size, "review"),
            movie_reviews_path(@movie) %></h3>