app/controllers/movies_controller.rb

SELECT  "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT ?  [["id", 8], ["LIMIT", 1]]
UPDATE "movies" SET "total_gross" = ?, "updated_at" = ? WHERE "movies"."id" = ?  [["total_gross", #<BigDecimal:7f6be9d70580,'0.123423437E9',9(18)>], ["updated_at", 2016-08-13 10:23:20 UTC], ["id", 8]]
---
  def update
    @movie = Movie.find(params[:id])
    if @movie.update(movie_params)

INSERT INTO "movies" ("title", "rating", "total_gross", "created_at", "updated_at", "description", "released_on", "cast", "director", "duration") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @movie = Movie.new(movie_params)
    if @movie.save