app/controllers/movies_controller.rb

UPDATE "movies" SET "title" = ?, "updated_at" = ? WHERE "movies"."id" = ?  [["title", "Updated Movie Title"], ["updated_at", 2016-08-13 09:01:37 UTC], ["id", 1]]
---
  def update
    @movie = Movie.find(params[:id])
    if @movie.update(movie_params)

INSERT INTO "movies" ("title", "rating", "total_gross", "created_at", "updated_at", "description", "released_on", "cast", "director", "duration", "image_file_name") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @movie = Movie.new(movie_params)
    if @movie.save

SELECT  "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "movies" WHERE "movies"."id" = ?  [["id", 1]]
---
  def destroy
    @movie = Movie.find(params[:id])
    @movie.destroy